Repository: vinhhaphoi/fptu-xcode-vstep-writing
Catalog: Localizable.xcstrings
Source language: en
Languages: vi

source: / week
vi: / tuần

# %lld / %lld used
source: %1$lld / %2$lld used
vi: %1$lld / %2$lld đã dùng

# %lld / %lld words min
source: %1$lld / %2$lld words min
vi: %1$lld / %2$lld từ tối thiểu

# %lld AI grading attempt%@ left for this essay today.
source: %1$lld AI grading attempt%2$@ left for this essay today.
vi: %1$lld lượt chấm AI còn lại cho bài viết hôm nay%2$@.

source: %lld left
vi: Còn %lld lượt

source: %lld min
vi: %lld phút

# %lld more attempt%@
source: %1$lld more attempt%2$@
vi: %1$lld lượt thêm%2$@

# %lld of %lld questions remaining today.
source: %1$lld of %2$lld questions remaining today.
vi: Còn %1$lld / %2$lld câu hỏi hôm nay.

source: %lld questions
vi: %lld câu hỏi

source: %lld used today
vi: %lld đã dùng hôm nay

source: %lld words
vi: %lld từ

# %lld/%lld refreshes available this week
source: %1$lld/%2$lld refreshes available this week
vi: %1$lld/%2$lld lượt làm mới còn lại tuần này

# %lld/%lld refreshes used this week
source: %1$lld/%2$lld refreshes used this week
vi: %1$lld/%2$lld lượt làm mới đã dùng tuần này

source: © 2026 All rights reserved
vi: © 2026 Bảo lưu mọi quyền

source: © 2026 All rights reserved.
vi: © 2026 Bảo lưu mọi quyền.

source: 0 left
vi: Còn 0

source: Account Information
vi: Thông tin tài khoản

source: Active
vi: Đang hoạt động

source: Active Plan
vi: Gói đang dùng

source: Advanced
vi: Nâng cao

source: AI Chatbot — Subscribers Only
vi: AI Chatbot — Chỉ dành cho thành viên

source: AI Graded
vi: Đã chấm bởi AI

source: AI Grading
vi: Đang chấm bằng AI

source: AI Grading Process
vi: Quy trình chấm AI

source: AI Progress Insights
vi: Phân tích tiến độ AI

source: AI Score
vi: Điểm AI

source: AI Score:
vi: Điểm AI:

source: AI-generated score. For reference only.
vi: Điểm do AI tạo ra. Chỉ để tham khảo.

source: AI-Powered Grading
vi: Chấm điểm bằng AI

source: All
vi: Tất cả

source: All attempts are graded automatically by Gemini AI using VSTEP rubrics. Scores are for reference only.
vi: Tất cả bài nộp được chấm tự động bởi Gemini AI theo thang điểm VSTEP. Điểm chỉ mang tính tham khảo.

source: Already have an account?
vi: Đã có tài khoản?

source: Already purchased? Tap to restore your subscription.
vi: Đã mua trước đó? Nhấn để khôi phục đăng ký.

source: Analyze My Progress
vi: Phân tích tiến độ của tôi

source: Analyzing your progress
vi: Đang phân tích tiến độ của bạn

source: and
vi: và

source: App is displaying in English
vi: Ứng dụng đang hiển thị bằng tiếng Anh

source: App is displaying in Vietnamese
vi: Ứng dụng đang hiển thị bằng tiếng Việt

source: Are you confirm to sign out?
vi: Bạn có chắc muốn đăng xuất?

source: Ask something...
vi: Nhập câu hỏi...

source: Attempt #%lld
vi: Lần thử #%lld

source: Auto-refresh after grading
vi: Tự động làm mới sau khi chấm

source: Awaiting AI grading
vi: Đang chờ chấm AI

source: Beta feature
vi: Tính năng thử nghiệm

source: By continuing, you agree to our
vi: Khi tiếp tục, bạn đồng ý với

source: Cancel
vi: Hủy

source: Change Password
vi: Đổi mật khẩu

source: Chat
vi: Hội thoại

source: Chat History
vi: Lịch sử hội thoại

source: Choose a Plan
vi: Chọn gói

source: Close
vi: Đóng

source: Collapse
vi: Thu gọn

source: Coming soon...
vi: Sắp ra mắt...

source: Complete your first essay to see your progress here.
vi: Hoàn thành bài viết đầu tiên để xem tiến độ tại đây.

source: Complete your first essay to see your score here.
vi: Hoàn thành bài viết đầu tiên để xem điểm tại đây.

source: Contact us
vi: Liên hệ chúng tôi

source: Continue with Google
vi: Tiếp tục với Google

source: Create Account
vi: Tạo tài khoản

source: Daily Limit Reached
vi: Đã đạt giới hạn hàng ngày

source: Dark Mode
vi: Chế độ tối

source: Delete
vi: Xóa

source: Delete Account
vi: Xóa tài khoản

source: Delete All
vi: Xóa tất cả

source: Delete all conversations?
vi: Xóa tất cả hội thoại?

source: Delete all notifications?
vi: Xóa tất cả thông báo?

source: Display name
vi: Tên hiển thị

source: Don't have an account?
vi: Chưa có tài khoản?

source: Earlier attempt
vi: Lần thử trước

source: Edit Information
vi: Chỉnh sửa thông tin

source: Edit your VSTEP account
vi: Chỉnh sửa tài khoản VSTEP

source: Enable
vi: Bật

source: Enable to receive essay results, assignments and blog updates
vi: Bật để nhận kết quả bài luận, bài tập và cập nhật blog

source: Enable to sign in faster without entering your password
vi: Bật để đăng nhập nhanh hơn mà không cần nhập mật khẩu

source: Error
vi: Lỗi

source: Feedback will appear here once graded
vi: Nhận xét sẽ hiển thị sau khi chấm

source: Forgot password?
vi: Quên mật khẩu?

source: Gemini AI is analyzing your essay against the VSTEP rubric. This typically takes 10–30 seconds.
vi: Gemini AI đang phân tích bài viết theo thang điểm VSTEP. Thường mất 10–30 giây.

source: Gemini AI is analyzing your essay…
vi: Gemini AI đang phân tích bài viết của bạn…

source: Gemini AI is reviewing your essay
vi: Gemini AI đang xem xét bài viết của bạn

source: Gemini AI is still processing your essay.
vi: Gemini AI vẫn đang xử lý bài viết của bạn.

source: Graded by Gemini AI
vi: Đã chấm bởi Gemini AI

source: Grading History
vi: Lịch sử chấm điểm

source: Grammar
vi: Ngữ pháp

source: Grammar Guide
vi: Hướng dẫn ngữ pháp

source: Hello,
vi: Xin chào,

source: Home
vi: Trang chủ

source: I understand that once approved, my account and all associated data will be permanently deleted.
vi: Tôi hiểu rằng khi được duyệt, tài khoản và toàn bộ dữ liệu của tôi sẽ bị xóa vĩnh viễn.

source: In-app writing may have limited experience. For best results, write offline and paste your essay here.
vi: Soạn thảo trong app có thể bị giới hạn. Để tốt nhất, hãy viết ngoại tuyến rồi dán bài vào đây.

source: Join VSTEP Writing to start practicing
vi: Tham gia VSTEP Writing để bắt đầu luyện tập

source: Language
vi: Ngôn ngữ

# language_english
source: English
vi: Tiếng Anh

# language_vietnamese
source: Vietnamese
vi: Tiếng Việt

source: Last analyzed %@
vi: Phân tích lần cuối %@

source: Learn
vi: Học

source: Limit reached
vi: Đã đạt giới hạn

source: Limit Reached
vi: Đã đạt giới hạn

source: Loading plans...
vi: Đang tải gói...

source: Loading questions
vi: Đang tải câu hỏi

source: Loading scores
vi: Đang tải điểm

source: Loading your activity...
vi: Đang tải hoạt động của bạn...

source: Loading...
vi: Đang tải...

source: Manage passwords and account security
vi: Quản lý mật khẩu và bảo mật tài khoản

source: Manage your account information
vi: Quản lý thông tin tài khoản của bạn

source: Manage your subscription in App Store settings
vi: Quản lý đăng ký trong cài đặt App Store

source: Manage your subscriptions
vi: Quản lý đăng ký của bạn

source: Name
vi: Tên

source: Need help? Contact us
vi: Cần hỗ trợ? Liên hệ chúng tôi

source: New Attempt
vi: Lần thử mới

source: New Conversation
vi: Cuộc hội thoại mới

source: Next Goal
vi: Mục tiêu tiếp theo

source: No Active Plan
vi: Không có gói đang dùng

source: No activity yet
vi: Chưa có hoạt động

source: No comment was provided for this attempt.
vi: Không có nhận xét cho lần thử này.

source: No History Yet
vi: Chưa có lịch sử

source: No notifications yet
vi: Chưa có thông báo

source: No questions available
vi: Không có câu hỏi

source: No questions available for this level
vi: Không có câu hỏi cho cấp độ này

source: No questions left today. Resets at midnight.
vi: Hết câu hỏi hôm nay. Làm mới lúc nửa đêm.

source: No results for "%@"
vi: Không có kết quả cho "%@"

source: No submissions yet
vi: Chưa có bài nộp

source: Not now
vi: Không phải bây giờ

source: Notifications
vi: Thông báo

source: or
vi: hoặc

source: Overall Comment
vi: Nhận xét tổng thể

source: Overall Score
vi: Điểm tổng

source: Password is managed by Google and cannot be changed here.
vi: Mật khẩu do Google quản lý và không thể thay đổi tại đây.

source: Password Updated
vi: Mật khẩu đã cập nhật

source: Pending
vi: Đang chờ

source: Pending AI grading
vi: Đang chờ chấm AI

source: Please provide at least 10 characters
vi: Vui lòng nhập ít nhất 10 ký tự

source: Powered by Vinhhaphoi from NTHT × Vinhhaphoi
vi: Phát triển bởi Vinhhaphoi từ NTHT × Vinhhaphoi

source: Powered by Vinhhaphoi from NTHT x Vinhhaphoi
vi: Phát triển bởi Vinhhaphoi từ NTHT x Vinhhaphoi

source: Practise VSTEP Task 1 & Task 2 essays
vi: Luyện viết VSTEP Task 1 & Task 2

source: Privacy Policy
vi: Chính sách bảo mật

source: Profile
vi: Hồ sơ

source: Profile Updated
vi: Hồ sơ đã cập nhật

source: Pull down to refresh
vi: Kéo xuống để làm mới

source: Question %lld
vi: Câu %lld

source: Re-submit for AI Grading
vi: Nộp lại để chấm AI

source: Re-submit for AI Grading?
vi: Nộp lại để chấm AI?

source: Ready to practice today?
vi: Sẵn sàng luyện tập hôm nay chưa?

source: Reason
vi: Lý do

source: Recent Activity
vi: Hoạt động gần đây

source: Reload
vi: Tải lại

source: Renews
vi: Gia hạn

source: Renews %@
vi: Gia hạn %@

source: Request Account Deletion
vi: Yêu cầu xóa tài khoản

source: Request Submitted
vi: Đã gửi yêu cầu

source: Required
vi: Bắt buộc

source: Requirements
vi: Yêu cầu

source: Resets at midnight
vi: Làm mới lúc nửa đêm

source: Restore Purchases
vi: Khôi phục mua hàng

source: Retry
vi: Thử lại

source: Save Changes
vi: Lưu thay đổi

source: Score
vi: Điểm

source: Search questions...
vi: Tìm câu hỏi...

source: Security
vi: Bảo mật

source: Settings
vi: Cài đặt

source: Show all %lld
vi: Xem tất cả %lld

source: Showing previous analysis
vi: Đang hiển thị phân tích trước đó

source: Sign In
vi: Đăng nhập

source: Sign in faster and more securely next time.
vi: Đăng nhập nhanh hơn và bảo mật hơn lần sau.

source: Sign in to continue
vi: Đăng nhập để tiếp tục

source: Sign in to continue your learning
vi: Đăng nhập để tiếp tục học

source: Sign in with %@
vi: Đăng nhập bằng %@

source: Sign out
vi: Đăng xuất

source: Sign Out
vi: Đăng xuất

source: Sign Up
vi: Đăng ký

source: Soon
vi: Sắp ra mắt

source: Start Writing
vi: Bắt đầu viết

source: Start writing your essay here…
vi: Bắt đầu viết bài của bạn tại đây…

source: Submit
vi: Nộp bài

source: Submit a request to delete your account. An admin will review and process it.
vi: Gửi yêu cầu xóa tài khoản. Quản trị viên sẽ xem xét và xử lý.

source: Submit and get at least 2 graded essays to unlock AI coaching.
vi: Nộp và nhận ít nhất 2 bài được chấm để mở khóa AI coaching.

source: Submit Deletion Request
vi: Gửi yêu cầu xóa

source: Submit for AI Grading
vi: Nộp để chấm AI

source: Submit for AI Grading?
vi: Nộp để chấm AI?

source: Submitting…
vi: Đang nộp bài…

source: Subscribe
vi: Đăng ký

source: Subscriptions
vi: Gói đăng ký

source: Suggested Structure
vi: Cấu trúc gợi ý

source: Tap below to analyze your writing progress with AI.
vi: Nhấn bên dưới để phân tích tiến độ viết bằng AI.

source: Target
vi: Mục tiêu

source: Target Level
vi: Cấp độ mục tiêu

source: Targeted Advice
vi: Lời khuyên cụ thể

source: Tell us why you want to leave...
vi: Cho chúng tôi biết lý do bạn muốn rời đi...

source: Terms
vi: Điều khoản

source: Terms of Use
vi: Điều khoản sử dụng

source: Thank you for your feedback
vi: Cảm ơn phản hồi của bạn

source: These fields cannot be changed.
vi: Các trường này không thể thay đổi.

source: This action cannot be undone.
vi: Hành động này không thể hoàn tác.

source: This score is generated by AI and is for reference only. It may not reflect official VSTEP scoring.
vi: Điểm này do AI tạo ra và chỉ mang tính tham khảo. Có thể không phản ánh điểm VSTEP chính thức.

source: This will create a new submission attempt. Your previous result will be saved in history. Results typically appear within 10–30 seconds.
vi: Thao tác này sẽ tạo lần nộp mới. Kết quả trước sẽ được lưu trong lịch sử. Kết quả thường xuất hiện trong 10–30 giây.

source: This will permanently delete all chat history.
vi: Thao tác này sẽ xóa vĩnh viễn toàn bộ lịch sử hội thoại.

source: Tips
vi: Mẹo

source: Today's Usage
vi: Sử dụng hôm nay

source: Unlimited
vi: Không giới hạn

source: Unlock your full writing potential
vi: Phát huy tối đa tiềm năng viết của bạn

source: Update Password
vi: Cập nhật mật khẩu

source: Update your account password anytime.
vi: Cập nhật mật khẩu tài khoản bất cứ lúc nào.

source: Upgrade
vi: Nâng cấp

source: Upgrade to Advanced or Premier to ask unlimited writing questions, get grammar tips, and practice strategies.
vi: Nâng cấp lên Advanced hoặc Premier để hỏi không giới hạn, nhận mẹo ngữ pháp và chiến lược luyện tập.

source: Upgrade to get AI-powered analysis of your writing progress.
vi: Nâng cấp để nhận phân tích tiến độ viết bằng AI.

source: Upgrade to unlock all features
vi: Nâng cấp để mở khóa tất cả tính năng

source: Upgrade to use the AI chatbot...
vi: Nâng cấp để sử dụng AI chatbot...

source: Used up
vi: Đã hết

source: Uses 1 quota when a new essay is graded
vi: Dùng 1 lượt khi có bài viết mới được chấm

source: Version 1.0.0
vi: Phiên bản 1.0.0

source: View All
vi: Xem tất cả

source: View Plans
vi: Xem các gói

source: VSTEP Writing Assistant
vi: Trợ lý VSTEP Writing

source: Weekly Limit Reached
vi: Đã đạt giới hạn tuần

source: What will be deleted
vi: Những gì sẽ bị xóa

# Write at least %lld more word%@ to submit.
source: Write at least %1$lld more word%2$@ to submit.
vi: Viết thêm ít nhất %1$lld từ%2$@ để nộp bài.

source: Writing Tips
vi: Mẹo viết

source: You are writing a new attempt. Your previous result is saved in history.
vi: Bạn đang viết lần thử mới. Kết quả trước đã được lưu trong lịch sử.

source: You will be asked to authenticate with %@ on next launch
vi: Bạn sẽ được yêu cầu xác thực bằng %@ khi khởi động lần sau

source: You will receive updates and alerts
vi: Bạn sẽ nhận được các cập nhật và cảnh báo

source: Your account has been disabled and your deletion request has been sent. An admin will review and process it shortly.
vi: Tài khoản của bạn đã bị vô hiệu hóa và yêu cầu xóa đã được gửi. Quản trị viên sẽ xem xét sớm.

source: Your AI insight refreshes reset every Monday. You can still view your last analysis below.
vi: Lượt làm mới AI Insights của bạn đặt lại mỗi thứ Hai. Bạn vẫn có thể xem phân tích gần nhất bên dưới.

source: Your conversations will appear here.
vi: Các cuộc hội thoại của bạn sẽ hiển thị tại đây.

source: Your Essay
vi: Bài viết của bạn

source: Your essay will be automatically graded by Gemini AI based on VSTEP rubrics. Results typically appear within 10–30 seconds.
vi: Bài viết sẽ được chấm tự động bởi Gemini AI theo thang điểm VSTEP. Kết quả thường xuất hiện trong 10–30 giây.

source: Your essay will be automatically graded by Gemini AI. Results typically appear within 10–30 seconds. Once submitted, you cannot edit this attempt.
vi: Bài viết sẽ được chấm tự động bởi Gemini AI. Kết quả thường xuất hiện trong 10–30 giây. Sau khi nộp, bạn không thể chỉnh sửa lần thử này.

source: Your password has been changed successfully.
vi: Mật khẩu đã được thay đổi thành công.

source: Your profile has been updated successfully.
vi: Hồ sơ của bạn đã được cập nhật thành công.

source: Your request will be reviewed by an admin. You will be notified once it is processed.
vi: Yêu cầu của bạn sẽ được quản trị viên xem xét. Bạn sẽ nhận thông báo khi được xử lý.

source: Your Submission
vi: Bài nộp của bạn
